{
  "my name is ralph.": "Meu nome é Ralph.",
  "ralph is a common name.": "Ralph é um nome comum.",
  "ralph is my favorite character.": "Ralph é meu personagem favorito.",
  "ralph is a great guy.": "O Ralph é uma ótima pessoa.",
  "ralph loves to play soccer.": "Ralph gosta de jogar futebol.",
  "the movie has a strong sexual theme.": "O filme tem um forte tema sexual.",
  "the book is about sexual relationships.": "O livro trata de relacionamentos sexuais.",
  "the doctor is a sexual health specialist.": "O médico é um especialista em saúde sexual.",
  "the movie is too sexual for children.": "O filme é muito sexual para crianças.",
  "the book explores sexual identity.": "O livro explora a identidade sexual.",
  "the newbie is struggling to keep up.": "O novato está se esforçando para acompanhar.",
  "the newbie made a lot of mistakes.": "O novato cometeu muitos erros.",
  "the newbie is very enthusiastic.": "O novato está muito entusiasmado.",
  "the newbie is a quick learner.": "O novato aprende rápido.",
  "the newbie is eager to please.": "O novato está ansioso para agradar.",
  "the movie got a high rating.": "O filme recebeu uma classificação alta.",
  "the restaurant has a good rating.": "O restaurante tem uma boa classificação.",
  "the product has a low rating.": "O produto tem uma classificação baixa.",
  "the movie has a bad rating.": "O filme tem uma classificação ruim.",
  "the restaurant has a high rating.": "O restaurante tem uma classificação alta.",
  "the store sells bulk quantities.": "A loja vende grandes quantidades.",
  "the company produces bulk orders.": "A empresa produz pedidos em grandes quantidades.",
  "the store has a bulk discount.": "A loja tem um desconto para grandes quantidades.",
  "the company ships bulk products.": "A empresa envia produtos a granel.",
  "the store sells bulk items.": "A loja vende itens a granel.",
  "the company is moving to a new location.": "A empresa está se mudando para um novo local.",
  "the family moved to a new house.": "A família se mudou para uma nova casa.",
  "the player moves quickly on the field.": "O jogador se movimenta rapidamente no campo.",
  "the company moved to a new office.": "A empresa mudou-se para um novo escritório.",
  "the family moved to a new city.": "A família se mudou para uma nova cidade.",
  "the patient gave their consent.": "O paciente deu seu consentimento.",
  "the company needs consent from the owner.": "A empresa precisa do consentimento do proprietário.",
  "the child needs consent to play.": "A criança precisa de consentimento para brincar.",
  "the doctor needs consent to operate.": "O médico precisa de consentimento para operar.",
  "the company needs consent to sell.": "A empresa precisa de consentimento para vender.",
  "the company is doing logging for the forest.": "A empresa está fazendo a extração de madeira para a floresta.",
  "the company needs logging for the database.": "A empresa precisa de um registro para o banco de dados.",
  "the company is doing logging for the website.": "A empresa está fazendo o registro do site.",
  "the company needs logging for the server.": "A empresa precisa de um registro de log para o servidor.",
  "the company is doing logging for the app.": "A empresa está fazendo o registro do aplicativo.",
  "the rrp is higher than the sale price.": "O RRP é maior do que o preço de venda.",
  "the rrp is lower than the market price.": "O RRP é menor do que o preço de mercado.",
  "the rrp is the same as the sale price.": "O RRP é o mesmo que o preço de venda.",
  "the rrp is higher than the wholesale price.": "O RRP é mais alto do que o preço de atacado.",
  "the rrp is lower than the retail price.": "O RRP é menor do que o preço de varejo.",
  "the spouse is very supportive.": "O cônjuge dá muito apoio.",
  "the spouse is very loving.": "O cônjuge é muito amoroso.",
  "the spouse is very caring.": "O cônjuge é muito atencioso.",
  "the spouse is very helpful.": "O cônjuge é muito prestativo.",
  "the spouse is very understanding.": "O cônjuge é muito compreensivo.",
  "the selected candidate will be interviewed.": "O candidato selecionado será entrevistado.",
  "the selected items are on sale.": "Os itens selecionados estão em promoção.",
  "the selected team won the championship.": "A equipe selecionada venceu o campeonato.",
  "the selected students will attend the conference.": "Os alunos selecionados participarão da conferência.",
  "the selected menu items are gluten-free.": "Os itens selecionados do cardápio não contêm glúten.",
  "the bonus will be paid next week.": "O bônus será pago na próxima semana.",
  "the bonus was a surprise gift.": "O bônus foi um presente surpresa.",
  "the bonus is a reward for hard work.": "O bônus é uma recompensa pelo trabalho árduo.",
  "the bonus will be added to your salary.": "O bônus será adicionado ao seu salário.",
  "the bonus is a one-time payment.": "O bônus é um pagamento único.",
  "the doc is a medical professional.": "O médico é um profissional da área médica.",
  "the doc is a file on your computer.": "O documento é um arquivo em seu computador.",
  "the doc is a person who gives advice.": "O médico é uma pessoa que dá conselhos.",
  "the doc is a type of paper.": "O documento é um tipo de papel.",
  "the doc is a medical record.": "O documento é um registro médico.",
  "the square is a type of shape.": "O quadrado é um tipo de forma.",
  "the square is a type of building.": "A praça é um tipo de edifício.",
  "the square is a public space.": "A praça é um espaço público.",
  "the square is a type of number.": "O quadrado é um tipo de número.",
  "the square is a type of fruit.": "O quadrado é um tipo de fruta.",
  "the movie is starring leonardo dicaprio.": "O filme é estrelado por Leonardo DiCaprio.",
  "the play is starring a new cast.": "A peça é estrelada por um novo elenco.",
  "the movie is starring a famous actress.": "O filme é estrelado por uma atriz famosa.",
  "the play is starring a local talent.": "A peça é estrelada por um talento local.",
  "the movie is starring a well-known actor.": "O filme é estrelado por um ator conhecido.",
  "the peer is a type of computer network.": "O par é um tipo de rede de computadores.",
  "the peer is a type of social relationship.": "O par é um tipo de relacionamento social.",
  "the peer is a type of equal status.": "O par é um tipo de status igual.",
  "the peer is a type of colleague.": "O par é um tipo de colega.",
  "the peer is a type of friend.": "O colega é um tipo de amigo.",
  "the auto feature is convenient.": "O recurso automático é conveniente.",
  "the auto industry is growing.": "O setor automotivo está crescendo.",
  "the auto mode is easy to use.": "O modo automático é fácil de usar.",
  "the auto system is reliable.": "O sistema automático é confiável.",
  "the auto part is expensive.": "A peça automotiva é cara.",
  "the grad is a type of degree.": "O grad é um tipo de diploma.",
  "the grad is a type of level.": "O grau é um tipo de nível.",
  "the grad is a type of measure.": "O grau é um tipo de medida.",
  "the grad is a type of unit.": "O grau é um tipo de unidade.",
  "the grad is a type of rank.": "O grau é um tipo de classificação.",
  "the jurisdiction is a type of authority.": "A jurisdição é um tipo de autoridade.",
  "the jurisdiction is a type of power.": "A jurisdição é um tipo de poder.",
  "the jurisdiction is a type of responsibility.": "A jurisdição é um tipo de responsabilidade.",
  "the jurisdiction is a type of scope.": "A jurisdição é um tipo de escopo.",
  "the jurisdiction is a type of area.": "A jurisdição é um tipo de área."
}