{
  "my name is ralph.": "Meu nome é Ralph.",
  "ralph is a common name.": "Ralph é um nome comum.",
  "ralph is my favorite character.": "Ralph é meu personagem favorito.",
  "ralph is a great guy.": "O Ralph é uma ótima pessoa.",
  "ralph loves to play soccer.": "Ralph gosta de jogar futebol.",
  "the movie has a strong sexual theme.": "O filme tem um forte tema sexual.",
  "the book is about sexual relationships.": "O livro trata de relacionamentos sexuais.",
  "the doctor is a sexual health specialist.": "O médico é um especialista em saúde sexual.",
  "the movie is too sexual for children.": "O filme é muito sexual para crianças.",
  "the book explores sexual identity.": "O livro explora a identidade sexual.",
  "the newbie is struggling to keep up.": "O novato está se esforçando para acompanhar.",
  "the newbie made a lot of mistakes.": "O novato cometeu muitos erros.",
  "the newbie is very enthusiastic.": "O novato está muito entusiasmado.",
  "the newbie is a quick learner.": "O novato aprende rápido.",
  "the newbie is eager to please.": "O novato está ansioso para agradar.",
  "the movie got a high rating.": "O filme recebeu uma classificação alta.",
  "the restaurant has a good rating.": "O restaurante tem uma boa classificação.",
  "the product has a low rating.": "O produto tem uma classificação baixa.",
  "the movie has a bad rating.": "O filme tem uma classificação ruim.",
  "the restaurant has a high rating.": "O restaurante tem uma classificação alta.",
  "the store sells bulk quantities.": "A loja vende grandes quantidades.",
  "the company produces bulk orders.": "A empresa produz pedidos em grandes quantidades.",
  "the store has a bulk discount.": "A loja tem um desconto para grandes quantidades.",
  "the company ships bulk products.": "A empresa envia produtos a granel.",
  "the store sells bulk items.": "A loja vende itens a granel.",
  "the company is moving to a new location.": "A empresa está se mudando para um novo local.",
  "the family moved to a new house.": "A família se mudou para uma nova casa.",
  "the player moves quickly on the field.": "O jogador se movimenta rapidamente no campo.",
  "the company moved to a new office.": "A empresa mudou-se para um novo escritório.",
  "the family moved to a new city.": "A família se mudou para uma nova cidade.",
  "the patient gave their consent.": "O paciente deu seu consentimento.",
  "the company needs consent from the owner.": "A empresa precisa do consentimento do proprietário.",
  "the child needs consent to play.": "A criança precisa de consentimento para brincar.",
  "the doctor needs consent to operate.": "O médico precisa de consentimento para operar.",
  "the company needs consent to sell.": "A empresa precisa de consentimento para vender.",
  "the company is doing logging for the forest.": "A empresa está fazendo a extração de madeira para a floresta.",
  "the company needs logging for the database.": "A empresa precisa de um registro para o banco de dados.",
  "the company is doing logging for the website.": "A empresa está fazendo o registro do site.",
  "the company needs logging for the server.": "A empresa precisa de um registro de log para o servidor.",
  "the company is doing logging for the app.": "A empresa está fazendo o registro do aplicativo.",
  "the rrp is higher than the sale price.": "O RRP é maior do que o preço de venda.",
  "the rrp is lower than the market price.": "O RRP é menor do que o preço de mercado.",
  "the rrp is the same as the sale price.": "O RRP é o mesmo que o preço de venda.",
  "the rrp is higher than the wholesale price.": "O RRP é mais alto do que o preço de atacado.",
  "the rrp is lower than the retail price.": "O RRP é menor do que o preço de varejo.",
  "the spouse is very supportive.": "O cônjuge dá muito apoio.",
  "the spouse is very loving.": "O cônjuge é muito amoroso.",
  "the spouse is very caring.": "O cônjuge é muito atencioso.",
  "the spouse is very helpful.": "O cônjuge é muito prestativo.",
  "the spouse is very understanding.": "O cônjuge é muito compreensivo.",
  "the selected candidate will be interviewed.": "O candidato selecionado será entrevistado.",
  "the selected items are on sale.": "Os itens selecionados estão em promoção.",
  "the selected team won the championship.": "A equipe selecionada venceu o campeonato.",
  "the selected students will attend the conference.": "Os alunos selecionados participarão da conferência.",
  "the selected menu items are gluten-free.": "Os itens selecionados do cardápio não contêm glúten.",
  "the bonus will be paid next week.": "O bônus será pago na próxima semana.",
  "the bonus was a surprise gift.": "O bônus foi um presente surpresa.",
  "the bonus is a reward for hard work.": "O bônus é uma recompensa pelo trabalho árduo.",
  "the bonus will be added to your salary.": "O bônus será adicionado ao seu salário.",
  "the bonus is a one-time payment.": "O bônus é um pagamento único.",
  "the doc is a medical professional.": "O médico é um profissional da área médica.",
  "the doc is a file on your computer.": "O documento é um arquivo em seu computador.",
  "the doc is a person who gives advice.": "O médico é uma pessoa que dá conselhos.",
  "the doc is a type of paper.": "O documento é um tipo de papel.",
  "the doc is a medical record.": "O documento é um registro médico.",
  "the square is a type of shape.": "O quadrado é um tipo de forma.",
  "the square is a type of building.": "A praça é um tipo de edifício.",
  "the square is a public space.": "A praça é um espaço público.",
  "the square is a type of number.": "O quadrado é um tipo de número.",
  "the square is a type of fruit.": "O quadrado é um tipo de fruta.",
  "the movie is starring leonardo dicaprio.": "O filme é estrelado por Leonardo DiCaprio.",
  "the play is starring a new cast.": "A peça é estrelada por um novo elenco.",
  "the movie is starring a famous actress.": "O filme é estrelado por uma atriz famosa.",
  "the play is starring a local talent.": "A peça é estrelada por um talento local.",
  "the movie is starring a well-known actor.": "O filme é estrelado por um ator conhecido.",
  "the peer is a type of computer network.": "O par é um tipo de rede de computadores.",
  "the peer is a type of social relationship.": "O par é um tipo de relacionamento social.",
  "the peer is a type of equal status.": "O par é um tipo de status igual.",
  "the peer is a type of colleague.": "O par é um tipo de colega.",
  "the peer is a type of friend.": "O colega é um tipo de amigo.",
  "the auto feature is convenient.": "O recurso automático é conveniente.",
  "the auto industry is growing.": "O setor automotivo está crescendo.",
  "the auto mode is easy to use.": "O modo automático é fácil de usar.",
  "the auto system is reliable.": "O sistema automático é confiável.",
  "the auto part is expensive.": "A peça automotiva é cara.",
  "the grad is a type of degree.": "O grad é um tipo de diploma.",
  "the grad is a type of level.": "O grau é um tipo de nível.",
  "the grad is a type of measure.": "O grau é um tipo de medida.",
  "the grad is a type of unit.": "O grau é um tipo de unidade.",
  "the grad is a type of rank.": "O grau é um tipo de classificação.",
  "the jurisdiction is a type of authority.": "A jurisdição é um tipo de autoridade.",
  "the jurisdiction is a type of power.": "A jurisdição é um tipo de poder.",
  "the jurisdiction is a type of responsibility.": "A jurisdição é um tipo de responsabilidade.",
  "the jurisdiction is a type of scope.": "A jurisdição é um tipo de escopo.",
  "the jurisdiction is a type of area.": "A jurisdição é um tipo de área.",
  "i\u0027m looking for an apartment in the city.": "Estou procurando um apartamento na cidade.",
  "the apartment has two bedrooms and a living room.": "O apartamento tem dois quartos e uma sala de estar.",
  "the rent for the apartment is too high.": "O aluguel do apartamento é muito alto.",
  "the apartment building has a pool and a gym.": "O edifício de apartamentos tem uma piscina e uma academia.",
  "i\u0027m moving into a new apartment next week.": "Vou me mudar para um novo apartamento na próxima semana.",
  "i love her so much that i would do anything for her.": "Eu a amo tanto que faria qualquer coisa por ela.",
  "he\u0027s so tired that he can barely walk.": "Ele está tão cansado que mal consegue andar.",
  "she\u0027s so happy that she\u0027s crying tears of joy.": "Ela está tão feliz que está chorando de alegria.",
  "he\u0027s so angry that he\u0027s shaking with rage.": "Ele está tão irritado que está tremendo de raiva.",
  "i\u0027m so hungry that i could eat a whole elephant.": "Estou com tanta fome que poderia comer um elefante inteiro.",
  "the cayman is a type of reptile found in the caribbean.": "O caimão é um tipo de réptil encontrado no Caribe.",
  "cayman islands is a popular tourist destination.": "As Ilhas Cayman são um destino turístico popular.",
  "the cayman is a carnivorous animal that eats fish and crustaceans.": "O jacaré é um animal carnívoro que se alimenta de peixes e crustáceos.",
  "cayman is a small island nation in the caribbean.": "Cayman é uma pequena nação insular no Caribe.",
  "the cayman is a protected species due to habitat loss.": "O jacaré é uma espécie protegida devido à perda de habitat.",
  "the fisherman used a reel to catch the big fish.": "O pescador usou um molinete para pegar o peixe grande.",
  "the camera uses a reel to record the footage.": "A câmera usa um carretel para gravar a filmagem.",
  "the reel is a device used to measure the length of a rope.": "O carretel é um dispositivo usado para medir o comprimento de uma corda.",
  "the reel is a type of fishing rod used for deep-sea fishing.": "O molinete é um tipo de vara de pesca usada para pesca em alto-mar.",
  "the reel is a device used to wind up a rope or cable.": "O carretel é um dispositivo usado para enrolar uma corda ou um cabo.",
  "the flash of lightning illuminated the dark sky.": "O clarão de um raio iluminou o céu escuro.",
  "the flash of the camera took a great picture.": "O flash da câmera tirou uma ótima foto.",
  "the flash of the gun was heard from a distance.": "O flash da arma foi ouvido à distância.",
  "the flash of the computer screen was too bright.": "O flash da tela do computador era muito brilhante.",
  "the flash of the idea came to me suddenly.": "O lampejo da ideia me veio de repente.",
  "the hole in the ground was deep and wide.": "O buraco no chão era profundo e largo.",
  "the hole in the wall needed to be fixed.": "O buraco na parede precisava ser consertado.",
  "the hole in the tire was causing the car to vibrate.": "O furo no pneu estava fazendo o carro vibrar.",
  "the hole in the fabric was a result of the tear.": "O buraco no tecido foi resultado do rasgo.",
  "the hole in the ground was a natural formation.": "O buraco no chão era uma formação natural.",
  "i searched the house for my keys.": "Procurei minhas chaves na casa.",
  "the police searched the suspect\u0027s car.": "A polícia revistou o carro do suspeito.",
  "she searched the internet for information.": "Ela procurou informações na Internet.",
  "he searched the library for a book.": "Ele procurou um livro na biblioteca.",
  "they searched the forest for wild animals.": "Eles procuraram animais selvagens na floresta.",
  "the government of the country is responsible for the economy.": "O governo do país é responsável pela economia.",
  "the government of the city is responsible for the infrastructure.": "O governo da cidade é responsável pela infraestrutura.",
  "the government of the state is responsible for education.": "O governo do estado é responsável pela educação.",
  "the government of the nation is responsible for foreign policy.": "O governo da nação é responsável pela política externa.",
  "the government of the corporation is responsible for the employees.": "O governo da corporação é responsável pelos funcionários.",
  "the partial eclipse of the sun was a rare sight.": "O eclipse parcial do sol foi uma visão rara.",
  "the partial payment of the bill was accepted.": "O pagamento parcial da conta foi aceito.",
  "the partial view of the city was from the top floor.": "A vista parcial da cidade era do último andar.",
  "the partial credit for the course was given.": "O crédito parcial do curso foi concedido.",
  "the partial solution to the problem was found.": "A solução parcial para o problema foi encontrada.",
  "she stated her opinion clearly and confidently.": "Ela expressou sua opinião com clareza e confiança.",
  "he stated the facts as they were.": "Ele expôs os fatos como eles eram.",
  "they stated their intention to leave the country.": "Eles declararam sua intenção de deixar o país.",
  "she stated her love for him in a poem.": "Ela declarou seu amor por ele em um poema.",
  "he stated the problem in simple terms.": "Ele expôs o problema em termos simples.",
  "the rich man bought a new car.": "O homem rico comprou um carro novo.",
  "the city is rich in history.": "A cidade é rica em história.",
  "the rich soil is perfect for farming.": "O solo rico é perfeito para a agricultura.",
  "the rich culture of the country is fascinating.": "A rica cultura do país é fascinante.",
  "the rich aroma of the coffee is amazing.": "O aroma rico do café é incrível.",
  "the vital organs of the body need oxygen.": "Os órgãos vitais do corpo precisam de oxigênio.",
  "the vital role of the teacher in the classroom.": "A função vital do professor na sala de aula.",
  "the vital signs of a patient are checked regularly.": "Os sinais vitais de um paciente são verificados regularmente.",
  "the vital information was missing from the report.": "As informações vitais estavam faltando no relatório.",
  "the vital work of the firefighters saved many lives.": "O trabalho vital dos bombeiros salvou muitas vidas.",
  "the rat scurried across the floor.": "O rato correu pelo chão.",
  "the rat in the wall was causing problems.": "O rato na parede estava causando problemas.",
  "the rat infestation in the city is a concern.": "A infestação de ratos na cidade é uma preocupação.",
  "the rat catcher was called to the scene.": "O coletor de ratos foi chamado ao local.",
  "the rat was caught in the trap.": "O rato foi pego na armadilha.",
  "the groups of friends were laughing together.": "Os grupos de amigos estavam rindo juntos.",
  "the groups of students were working on the project.": "Os grupos de alunos estavam trabalhando no projeto.",
  "the groups of people were waiting in line.": "Os grupos de pessoas estavam esperando na fila.",
  "the groups of animals were roaming free.": "Os grupos de animais estavam soltos.",
  "the groups of musicians were performing on stage.": "Os grupos de músicos estavam se apresentando no palco.",
  "the destiny of the universe is still unknown.": "O destino do universo ainda é desconhecido.",
  "the destiny of the country is uncertain.": "O destino do país é incerto.",
  "the destiny of the individual is shaped by choices.": "O destino do indivíduo é moldado por escolhas.",
  "the destiny of the planet is at risk.": "O destino do planeta está em risco.",
  "the destiny of the project is still undecided.": "O destino do projeto ainda não foi decidido.",
  "the token was used to unlock the door.": "O token foi usado para destrancar a porta.",
  "the token was exchanged for a prize.": "O token foi trocado por um prêmio.",
  "the token was used to access the website.": "O token foi usado para acessar o site.",
  "the token was a symbol of good luck.": "O token era um símbolo de boa sorte.",
  "the token was a reminder of a promise.": "O símbolo era um lembrete de uma promessa.",
  "the sea was calm and peaceful.": "O mar estava calmo e tranquilo.",
  "the sea was rough and stormy.": "O mar estava agitado e tempestuoso.",
  "the sea was a vast expanse of water.": "O mar era uma vasta extensão de água.",
  "the sea was a source of food for many people.": "O mar era uma fonte de alimento para muitas pessoas.",
  "the sea was a popular destination for tourists.": "O mar era um destino popular para os turistas.",
  "the devices were used to monitor the environment.": "Os dispositivos foram usados para monitorar o ambiente.",
  "the devices were connected to the internet.": "Os dispositivos estavam conectados à Internet.",
  "the devices were used to track the location.": "Os dispositivos foram usados para rastrear a localização.",
  "the devices were a source of entertainment.": "Os dispositivos eram uma fonte de entretenimento.",
  "the devices were a tool for communication.": "Os dispositivos eram uma ferramenta de comunicação.",
  "the pending task was delayed again.": "A tarefa pendente foi adiada novamente.",
  "the pending decision was made later.": "A decisão pendente foi tomada posteriormente.",
  "the pending bills were paid on time.": "As contas pendentes foram pagas em dia.",
  "the pending lawsuit was settled out of court.": "O processo pendente foi resolvido fora do tribunal.",
  "the pending project was put on hold.": "O projeto pendente foi suspenso.",
  "she brought her friend round to meet me.": "Ela trouxe sua amiga para me conhecer.",
  "he tried to bring the patient round after the accident.": "Ele tentou trazer o paciente de volta após o acidente.",
  "can you bring the kids round to play with mine?": "Você pode trazer as crianças para brincar com as minhas?",
  "the doctor brought the patient round with a shot of adrenaline.": "O médico trouxe o paciente com uma injeção de adrenalina.",
  "they brought the old car round to the front of the house.": "Eles trouxeram o carro velho para a frente da casa.",
  "she enrolled in the university last year.": "Ela se matriculou na universidade no ano passado.",
  "he enrolled his kids in the local school.": "Ele matriculou seus filhos na escola local.",
  "can you enroll me in the course?": "Vocês podem me inscrever no curso?",
  "they enrolled in the gym to get in shape.": "Eles se matricularam na academia para entrar em forma.",
  "i enrolled in the online course to learn more.": "Eu me inscrevi no curso on-line para saber mais.",
  "kathy is a great friend.": "Kathy é uma grande amiga.",
  "kathy loves to travel.": "Kathy adora viajar.",
  "kathy is a talented artist.": "Kathy é uma artista talentosa.",
  "kathy is a great cook.": "Kathy é uma ótima cozinheira.",
  "kathy is a wonderful person.": "Kathy é uma pessoa maravilhosa.",
  "this book is heavy.": "Esse livro é pesado.",
  "the traffic was heavy today.": "O trânsito estava pesado hoje.",
  "the rain was heavy last night.": "A chuva estava forte na noite passada.",
  "the music was heavy and loud.": "A música era pesada e alta.",
  "the workload was heavy this quarter.": "A carga de trabalho foi pesada neste trimestre.",
  "the complexity of the problem is difficult to understand.": "A complexidade do problema é difícil de entender.",
  "the complexity of the system is hard to manage.": "A complexidade do sistema é difícil de gerenciar.",
  "the complexity of the project is overwhelming.": "A complexidade do projeto é impressionante.",
  "the complexity of the issue is a major concern.": "A complexidade da questão é uma grande preocupação.",
  "the complexity of the data is a challenge to analyze.": "A complexidade dos dados é um desafio para a análise.",
  "the sender of the package was unknown.": "O remetente do pacote era desconhecido.",
  "the sender of the email was a robot.": "O remetente do e-mail era um robô.",
  "the sender of the letter was a friend.": "O remetente da carta era um amigo.",
  "the sender of the package was a company.": "O remetente do pacote era uma empresa.",
  "the sender of the message was a stranger.": "O remetente da mensagem era um estranho.",
  "the fathers of the children were present.": "Os pais das crianças estavam presentes.",
  "the fathers of the bride were honored.": "Os pais da noiva foram homenageados.",
  "the fathers of the country were proud.": "Os pais do país estavam orgulhosos.",
  "the fathers of the family were supportive.": "Os pais da família me deram apoio.",
  "the fathers of the church were wise.": "Os pais da igreja eram sábios.",
  "she caught the ball in mid-air.": "Ela pegou a bola em pleno ar.",
  "he caught the flu last week.": "Ele pegou gripe na semana passada.",
  "can you catch the bus at the next stop?": "Você pode pegar o ônibus no próximo ponto?",
  "they caught the thief in the act.": "Eles pegaram o ladrão em flagrante.",
  "i caught the fish with my bare hands.": "Peguei o peixe com minhas próprias mãos.",
  "her preference was for the red car.": "Sua preferência era pelo carro vermelho.",
  "his preference was for the quiet room.": "Sua preferência era pelo quarto silencioso.",
  "their preference was for the beach vacation.": "Sua preferência era por férias na praia.",
  "my preference is for the morning.": "Minha preferência é pela manhã.",
  "the preference of the customer is our top priority.": "A preferência do cliente é nossa maior prioridade.",
  "i\u0027m grateful for your help.": "Sou grato por sua ajuda.",
  "she\u0027s grateful for the opportunity.": "Ela é grata pela oportunidade.",
  "he\u0027s grateful for the support.": "Ele é grato pelo apoio.",
  "they\u0027re grateful for the kindness.": "Eles são gratos pela gentileza.",
  "we\u0027re grateful for the love.": "Somos gratos pelo amor.",
  "she sings similarly to her sister.": "Ela canta de forma semelhante à sua irmã.",
  "he drives similarly to his father.": "Ele dirige de forma semelhante ao seu pai.",
  "the two teams play similarly.": "As duas equipes jogam de forma semelhante.",
  "the new policy is implemented similarly across all departments.": "A nova política é implementada de forma semelhante em todos os departamentos.",
  "the two artists paint similarly.": "Os dois artistas pintam de forma semelhante.",
  "the company deals with several clients.": "A empresa lida com vários clientes.",
  "she deals with difficult customers.": "Ela lida com clientes difíceis.",
  "he deals with the financial department.": "Ele lida com o departamento financeiro.",
  "the new policy deals with employee benefits.": "A nova política trata dos benefícios dos funcionários.",
  "the team deals with a tough opponent.": "A equipe lida com um adversário difícil.",
  "the company operates in a wide variety of industries.": "A empresa opera em uma ampla variedade de setores.",
  "she has experience in a variety of fields.": "Ela tem experiência em uma variedade de campos.",
  "he is interested in a wide range of topics.": "Ele se interessa por uma ampla gama de tópicos.",
  "the new policy applies to a variety of situations.": "A nova política se aplica a uma variedade de situações.",
  "the team has expertise in a variety of areas.": "A equipe tem experiência em diversas áreas.",
  "the system monitors the network traffic.": "O sistema monitora o tráfego da rede.",
  "she monitors the patient\u0027s vital signs.": "Ela monitora os sinais vitais do paciente.",
  "he monitors the stock market.": "Ele monitora o mercado de ações.",
  "the new policy monitors employee performance.": "A nova política monitora o desempenho dos funcionários.",
  "the team monitors the weather forecast.": "A equipe monitora a previsão do tempo.",
  "the company uses a proc to manage its projects.": "A empresa usa um proc para gerenciar seus projetos.",
  "she is responsible for the proc department.": "Ela é responsável pelo departamento de compras.",
  "he is an expert in the proc field.": "Ele é um especialista na área de proc.",
  "the new policy affects the proc team.": "A nova política afeta a equipe de proc.",
  "the team is working on a new proc system.": "A equipe está trabalhando em um novo sistema de proc.",
  "she is an expert in marketing.": "Ela é especialista em marketing.",
  "he is an expert in finance.": "Ele é um especialista em finanças.",
  "the team has an expert in the field.": "A equipe tem um especialista na área.",
  "the new policy requires an expert opinion.": "A nova política exige uma opinião especializada.",
  "the company hires an expert consultant.": "A empresa contrata um consultor especializado.",
  "the company is based in dayton.": "A empresa está sediada em Dayton.",
  "she is from dayton.": "Ela é de Dayton.",
  "he lives in dayton.": "Ele mora em Dayton.",
  "the new policy affects the dayton team.": "A nova política afeta a equipe de Dayton.",
  "the team is visiting dayton.": "A equipe está visitando Dayton.",
  "the body is made up of cells.": "O corpo é composto de células.",
  "she is studying cells in biology.": "Ela está estudando células em biologia.",
  "he is an expert in cell biology.": "Ele é um especialista em biologia celular.",
  "the new policy affects cell division.": "A nova política afeta a divisão celular.",
  "the team is working on a new cell therapy.": "A equipe está trabalhando em uma nova terapia celular.",
  "the company is experiencing an enlargement of its market share.": "A empresa está experimentando um aumento de sua participação no mercado.",
  "she is studying the enlargement of the universe.": "Ela está estudando a ampliação do universo.",
  "he is an expert in enlargement techniques.": "Ele é um especialista em técnicas de ampliação.",
  "the new policy affects the enlargement of the company.": "A nova política afeta a ampliação da empresa.",
  "the team is working on a new enlargement project.": "A equipe está trabalhando em um novo projeto de ampliação.",
  "the lions are the kings of the savannah.": "Os leões são os reis da savana.",
  "she is studying lions in biology.": "Ela está estudando leões em biologia.",
  "he is an expert in lion behavior.": "Ele é um especialista em comportamento de leões.",
  "the new policy affects lion conservation.": "A nova política afeta a conservação dos leões.",
  "the team is working on a new lion sanctuary.": "A equipe está trabalhando em um novo santuário de leões.",
  "she cut up the old clothes to make a quilt.": "Ela cortou as roupas velhas para fazer uma colcha.",
  "he cut up the vegetables for the salad.": "Ele cortou os legumes para a salada.",
  "the chef cut up the meat for the stir-fry.": "O chef cortou a carne para o stir-fry.",
  "the kids cut up the paper to make a collage.": "As crianças cortaram o papel para fazer uma colagem.",
  "the surgeon cut up the patient to remove the tumor.": "O cirurgião cortou o paciente para remover o tumor.",
  "she planted a tree in her backyard.": "Ela plantou uma árvore em seu quintal.",
  "he planted a garden in his front yard.": "Ele plantou um jardim em seu jardim da frente.",
  "the farmer planted wheat in the field.": "O fazendeiro plantou trigo no campo.",
  "the couple planted a vineyard on their property.": "O casal plantou um vinhedo em sua propriedade.",
  "the architect planted a flag on the roof.": "O arquiteto colocou uma bandeira no telhado.",
  "he is an attorney for the company.": "Ele é advogado da empresa.",
  "she is an attorney for the non-profit organization.": "Ela é advogada da organização sem fins lucrativos.",
  "the attorney argued the case in court.": "O advogado defendeu o caso no tribunal.",
  "the attorney negotiated the contract.": "O advogado negociou o contrato.",
  "the attorney represented the client in the trial.": "O advogado representou o cliente no julgamento.",
  "she traveled to mexico for vacation.": "Ela viajou para o México de férias.",
  "he studied in mexico for a year.": "Ele estudou no México por um ano.",
  "the couple visited mexico for their honeymoon.": "O casal visitou o México em sua lua de mel.",
  "the family went to mexico for the holidays.": "A família foi para o México nas férias.",
  "the company has a factory in mexico.": "A empresa tem uma fábrica no México.",
  "the wagon was pulled by horses.": "A carroça era puxada por cavalos.",
  "she rode in the wagon to the festival.": "Ela foi de carroça para o festival.",
  "he drove the wagon through the countryside.": "Ele dirigiu a carroça pelo campo.",
  "the wagon was filled with hay.": "A carroça estava cheia de feno.",
  "the wagon was decorated for the parade.": "O vagão foi decorado para o desfile.",
  "i\u0027ve been working here since 2010.": "Estou trabalhando aqui desde 2010.",
  "she\u0027s been living in paris since last year.": "Ela está morando em Paris desde o ano passado.",
  "he\u0027s been studying english since he was a child.": "Ele estuda inglês desde criança.",
  "the company has been in business since 1995.": "A empresa está em atividade desde 1995.",
  "the concert will start since 8pm.": "O show começará a partir das 20h.",
  "the mobile phone is very convenient.": "O telefone celular é muito conveniente.",
  "the mobile home is a great option for retirees.": "A casa móvel é uma ótima opção para aposentados.",
  "the mobile app is very user-friendly.": "O aplicativo móvel é muito fácil de usar.",
  "the mobile device is very portable.": "O dispositivo móvel é muito portátil.",
  "the mobile office is very efficient.": "O escritório móvel é muito eficiente.",
  "she writes a blog about fashion.": "Ela escreve um blog sobre moda.",
  "he maintains a blog about technology.": "Ele mantém um blog sobre tecnologia.",
  "the company has a blog about their products.": "A empresa tem um blog sobre seus produtos.",
  "the blogger shared her thoughts on the topic.": "A blogueira compartilhou suas ideias sobre o assunto.",
  "the blog was very popular among readers.": "O blog era muito popular entre os leitores.",
  "she loves watching movies on the weekend.": "Ela adora assistir a filmes no fim de semana.",
  "he went to the movies with his friends.": "Ele foi ao cinema com seus amigos.",
  "the couple watched movies on their date night.": "O casal assistiu a filmes em sua noite de encontro.",
  "the movie theater showed a new release.": "O cinema exibiu um novo lançamento.",
  "the film festival featured many independent movies.": "O festival de cinema apresentou muitos filmes independentes."
}