{
  "my name is ralph.": "Meu nome é Ralph.",
  "ralph is a common name.": "Ralph é um nome comum.",
  "ralph is my favorite character.": "Ralph é meu personagem favorito.",
  "ralph is a great guy.": "O Ralph é uma ótima pessoa.",
  "ralph loves to play soccer.": "Ralph gosta de jogar futebol.",
  "the movie has a strong sexual theme.": "O filme tem um forte tema sexual.",
  "the book is about sexual relationships.": "O livro trata de relacionamentos sexuais.",
  "the doctor is a sexual health specialist.": "O médico é um especialista em saúde sexual.",
  "the movie is too sexual for children.": "O filme é muito sexual para crianças.",
  "the book explores sexual identity.": "O livro explora a identidade sexual.",
  "the newbie is struggling to keep up.": "O novato está se esforçando para acompanhar.",
  "the newbie made a lot of mistakes.": "O novato cometeu muitos erros.",
  "the newbie is very enthusiastic.": "O novato está muito entusiasmado.",
  "the newbie is a quick learner.": "O novato aprende rápido.",
  "the newbie is eager to please.": "O novato está ansioso para agradar.",
  "the movie got a high rating.": "O filme recebeu uma classificação alta.",
  "the restaurant has a good rating.": "O restaurante tem uma boa classificação.",
  "the product has a low rating.": "O produto tem uma classificação baixa.",
  "the movie has a bad rating.": "O filme tem uma classificação ruim.",
  "the restaurant has a high rating.": "O restaurante tem uma classificação alta.",
  "the store sells bulk quantities.": "A loja vende grandes quantidades.",
  "the company produces bulk orders.": "A empresa produz pedidos em grandes quantidades.",
  "the store has a bulk discount.": "A loja tem um desconto para grandes quantidades.",
  "the company ships bulk products.": "A empresa envia produtos a granel.",
  "the store sells bulk items.": "A loja vende itens a granel.",
  "the company is moving to a new location.": "A empresa está se mudando para um novo local.",
  "the family moved to a new house.": "A família se mudou para uma nova casa.",
  "the player moves quickly on the field.": "O jogador se movimenta rapidamente no campo.",
  "the company moved to a new office.": "A empresa mudou-se para um novo escritório.",
  "the family moved to a new city.": "A família se mudou para uma nova cidade.",
  "the patient gave their consent.": "O paciente deu seu consentimento.",
  "the company needs consent from the owner.": "A empresa precisa do consentimento do proprietário.",
  "the child needs consent to play.": "A criança precisa de consentimento para brincar.",
  "the doctor needs consent to operate.": "O médico precisa de consentimento para operar.",
  "the company needs consent to sell.": "A empresa precisa de consentimento para vender.",
  "the company is doing logging for the forest.": "A empresa está fazendo a extração de madeira para a floresta.",
  "the company needs logging for the database.": "A empresa precisa de um registro para o banco de dados.",
  "the company is doing logging for the website.": "A empresa está fazendo o registro do site.",
  "the company needs logging for the server.": "A empresa precisa de um registro de log para o servidor.",
  "the company is doing logging for the app.": "A empresa está fazendo o registro do aplicativo.",
  "the rrp is higher than the sale price.": "O RRP é maior do que o preço de venda.",
  "the rrp is lower than the market price.": "O RRP é menor do que o preço de mercado.",
  "the rrp is the same as the sale price.": "O RRP é o mesmo que o preço de venda.",
  "the rrp is higher than the wholesale price.": "O RRP é mais alto do que o preço de atacado.",
  "the rrp is lower than the retail price.": "O RRP é menor do que o preço de varejo.",
  "the spouse is very supportive.": "O cônjuge dá muito apoio.",
  "the spouse is very loving.": "O cônjuge é muito amoroso.",
  "the spouse is very caring.": "O cônjuge é muito atencioso.",
  "the spouse is very helpful.": "O cônjuge é muito prestativo.",
  "the spouse is very understanding.": "O cônjuge é muito compreensivo.",
  "the selected candidate will be interviewed.": "O candidato selecionado será entrevistado.",
  "the selected items are on sale.": "Os itens selecionados estão em promoção.",
  "the selected team won the championship.": "A equipe selecionada venceu o campeonato.",
  "the selected students will attend the conference.": "Os alunos selecionados participarão da conferência.",
  "the selected menu items are gluten-free.": "Os itens selecionados do cardápio não contêm glúten.",
  "the bonus will be paid next week.": "O bônus será pago na próxima semana.",
  "the bonus was a surprise gift.": "O bônus foi um presente surpresa.",
  "the bonus is a reward for hard work.": "O bônus é uma recompensa pelo trabalho árduo.",
  "the bonus will be added to your salary.": "O bônus será adicionado ao seu salário.",
  "the bonus is a one-time payment.": "O bônus é um pagamento único.",
  "the doc is a medical professional.": "O médico é um profissional da área médica.",
  "the doc is a file on your computer.": "O documento é um arquivo em seu computador.",
  "the doc is a person who gives advice.": "O médico é uma pessoa que dá conselhos.",
  "the doc is a type of paper.": "O documento é um tipo de papel.",
  "the doc is a medical record.": "O documento é um registro médico.",
  "the square is a type of shape.": "O quadrado é um tipo de forma.",
  "the square is a type of building.": "A praça é um tipo de edifício.",
  "the square is a public space.": "A praça é um espaço público.",
  "the square is a type of number.": "O quadrado é um tipo de número.",
  "the square is a type of fruit.": "O quadrado é um tipo de fruta.",
  "the movie is starring leonardo dicaprio.": "O filme é estrelado por Leonardo DiCaprio.",
  "the play is starring a new cast.": "A peça é estrelada por um novo elenco.",
  "the movie is starring a famous actress.": "O filme é estrelado por uma atriz famosa.",
  "the play is starring a local talent.": "A peça é estrelada por um talento local.",
  "the movie is starring a well-known actor.": "O filme é estrelado por um ator conhecido.",
  "the peer is a type of computer network.": "O par é um tipo de rede de computadores.",
  "the peer is a type of social relationship.": "O par é um tipo de relacionamento social.",
  "the peer is a type of equal status.": "O par é um tipo de status igual.",
  "the peer is a type of colleague.": "O par é um tipo de colega.",
  "the peer is a type of friend.": "O colega é um tipo de amigo.",
  "the auto feature is convenient.": "O recurso automático é conveniente.",
  "the auto industry is growing.": "O setor automotivo está crescendo.",
  "the auto mode is easy to use.": "O modo automático é fácil de usar.",
  "the auto system is reliable.": "O sistema automático é confiável.",
  "the auto part is expensive.": "A peça automotiva é cara.",
  "the grad is a type of degree.": "O grad é um tipo de diploma.",
  "the grad is a type of level.": "O grau é um tipo de nível.",
  "the grad is a type of measure.": "O grau é um tipo de medida.",
  "the grad is a type of unit.": "O grau é um tipo de unidade.",
  "the grad is a type of rank.": "O grau é um tipo de classificação.",
  "the jurisdiction is a type of authority.": "A jurisdição é um tipo de autoridade.",
  "the jurisdiction is a type of power.": "A jurisdição é um tipo de poder.",
  "the jurisdiction is a type of responsibility.": "A jurisdição é um tipo de responsabilidade.",
  "the jurisdiction is a type of scope.": "A jurisdição é um tipo de escopo.",
  "the jurisdiction is a type of area.": "A jurisdição é um tipo de área.",
  "i\u0027m looking for an apartment in the city.": "Estou procurando um apartamento na cidade.",
  "the apartment has two bedrooms and a living room.": "O apartamento tem dois quartos e uma sala de estar.",
  "the rent for the apartment is too high.": "O aluguel do apartamento é muito alto.",
  "the apartment building has a pool and a gym.": "O edifício de apartamentos tem uma piscina e uma academia.",
  "i\u0027m moving into a new apartment next week.": "Vou me mudar para um novo apartamento na próxima semana.",
  "i love her so much that i would do anything for her.": "Eu a amo tanto que faria qualquer coisa por ela.",
  "he\u0027s so tired that he can barely walk.": "Ele está tão cansado que mal consegue andar.",
  "she\u0027s so happy that she\u0027s crying tears of joy.": "Ela está tão feliz que está chorando de alegria.",
  "he\u0027s so angry that he\u0027s shaking with rage.": "Ele está tão irritado que está tremendo de raiva.",
  "i\u0027m so hungry that i could eat a whole elephant.": "Estou com tanta fome que poderia comer um elefante inteiro.",
  "the cayman is a type of reptile found in the caribbean.": "O caimão é um tipo de réptil encontrado no Caribe.",
  "cayman islands is a popular tourist destination.": "As Ilhas Cayman são um destino turístico popular.",
  "the cayman is a carnivorous animal that eats fish and crustaceans.": "O jacaré é um animal carnívoro que se alimenta de peixes e crustáceos.",
  "cayman is a small island nation in the caribbean.": "Cayman é uma pequena nação insular no Caribe.",
  "the cayman is a protected species due to habitat loss.": "O jacaré é uma espécie protegida devido à perda de habitat.",
  "the fisherman used a reel to catch the big fish.": "O pescador usou um molinete para pegar o peixe grande.",
  "the camera uses a reel to record the footage.": "A câmera usa um carretel para gravar a filmagem.",
  "the reel is a device used to measure the length of a rope.": "O carretel é um dispositivo usado para medir o comprimento de uma corda.",
  "the reel is a type of fishing rod used for deep-sea fishing.": "O molinete é um tipo de vara de pesca usada para pesca em alto-mar.",
  "the reel is a device used to wind up a rope or cable.": "O carretel é um dispositivo usado para enrolar uma corda ou um cabo.",
  "the flash of lightning illuminated the dark sky.": "O clarão de um raio iluminou o céu escuro.",
  "the flash of the camera took a great picture.": "O flash da câmera tirou uma ótima foto.",
  "the flash of the gun was heard from a distance.": "O flash da arma foi ouvido à distância.",
  "the flash of the computer screen was too bright.": "O flash da tela do computador era muito brilhante.",
  "the flash of the idea came to me suddenly.": "O lampejo da ideia me veio de repente.",
  "the hole in the ground was deep and wide.": "O buraco no chão era profundo e largo.",
  "the hole in the wall needed to be fixed.": "O buraco na parede precisava ser consertado.",
  "the hole in the tire was causing the car to vibrate.": "O furo no pneu estava fazendo o carro vibrar.",
  "the hole in the fabric was a result of the tear.": "O buraco no tecido foi resultado do rasgo.",
  "the hole in the ground was a natural formation.": "O buraco no chão era uma formação natural.",
  "i searched the house for my keys.": "Procurei minhas chaves na casa.",
  "the police searched the suspect\u0027s car.": "A polícia revistou o carro do suspeito.",
  "she searched the internet for information.": "Ela procurou informações na Internet.",
  "he searched the library for a book.": "Ele procurou um livro na biblioteca.",
  "they searched the forest for wild animals.": "Eles procuraram animais selvagens na floresta.",
  "the government of the country is responsible for the economy.": "O governo do país é responsável pela economia.",
  "the government of the city is responsible for the infrastructure.": "O governo da cidade é responsável pela infraestrutura.",
  "the government of the state is responsible for education.": "O governo do estado é responsável pela educação.",
  "the government of the nation is responsible for foreign policy.": "O governo da nação é responsável pela política externa.",
  "the government of the corporation is responsible for the employees.": "O governo da corporação é responsável pelos funcionários.",
  "the partial eclipse of the sun was a rare sight.": "O eclipse parcial do sol foi uma visão rara.",
  "the partial payment of the bill was accepted.": "O pagamento parcial da conta foi aceito.",
  "the partial view of the city was from the top floor.": "A vista parcial da cidade era do último andar.",
  "the partial credit for the course was given.": "O crédito parcial do curso foi concedido.",
  "the partial solution to the problem was found.": "A solução parcial para o problema foi encontrada.",
  "she stated her opinion clearly and confidently.": "Ela expressou sua opinião com clareza e confiança.",
  "he stated the facts as they were.": "Ele expôs os fatos como eles eram.",
  "they stated their intention to leave the country.": "Eles declararam sua intenção de deixar o país.",
  "she stated her love for him in a poem.": "Ela declarou seu amor por ele em um poema.",
  "he stated the problem in simple terms.": "Ele expôs o problema em termos simples.",
  "the rich man bought a new car.": "O homem rico comprou um carro novo.",
  "the city is rich in history.": "A cidade é rica em história.",
  "the rich soil is perfect for farming.": "O solo rico é perfeito para a agricultura.",
  "the rich culture of the country is fascinating.": "A rica cultura do país é fascinante.",
  "the rich aroma of the coffee is amazing.": "O aroma rico do café é incrível.",
  "the vital organs of the body need oxygen.": "Os órgãos vitais do corpo precisam de oxigênio.",
  "the vital role of the teacher in the classroom.": "A função vital do professor na sala de aula.",
  "the vital signs of a patient are checked regularly.": "Os sinais vitais de um paciente são verificados regularmente.",
  "the vital information was missing from the report.": "As informações vitais estavam faltando no relatório.",
  "the vital work of the firefighters saved many lives.": "O trabalho vital dos bombeiros salvou muitas vidas.",
  "the rat scurried across the floor.": "O rato correu pelo chão.",
  "the rat in the wall was causing problems.": "O rato na parede estava causando problemas.",
  "the rat infestation in the city is a concern.": "A infestação de ratos na cidade é uma preocupação.",
  "the rat catcher was called to the scene.": "O coletor de ratos foi chamado ao local.",
  "the rat was caught in the trap.": "O rato foi pego na armadilha.",
  "the groups of friends were laughing together.": "Os grupos de amigos estavam rindo juntos.",
  "the groups of students were working on the project.": "Os grupos de alunos estavam trabalhando no projeto.",
  "the groups of people were waiting in line.": "Os grupos de pessoas estavam esperando na fila.",
  "the groups of animals were roaming free.": "Os grupos de animais estavam soltos.",
  "the groups of musicians were performing on stage.": "Os grupos de músicos estavam se apresentando no palco.",
  "the destiny of the universe is still unknown.": "O destino do universo ainda é desconhecido.",
  "the destiny of the country is uncertain.": "O destino do país é incerto.",
  "the destiny of the individual is shaped by choices.": "O destino do indivíduo é moldado por escolhas.",
  "the destiny of the planet is at risk.": "O destino do planeta está em risco.",
  "the destiny of the project is still undecided.": "O destino do projeto ainda não foi decidido.",
  "the token was used to unlock the door.": "O token foi usado para destrancar a porta.",
  "the token was exchanged for a prize.": "O token foi trocado por um prêmio.",
  "the token was used to access the website.": "O token foi usado para acessar o site.",
  "the token was a symbol of good luck.": "O token era um símbolo de boa sorte.",
  "the token was a reminder of a promise.": "O símbolo era um lembrete de uma promessa.",
  "the sea was calm and peaceful.": "O mar estava calmo e tranquilo.",
  "the sea was rough and stormy.": "O mar estava agitado e tempestuoso.",
  "the sea was a vast expanse of water.": "O mar era uma vasta extensão de água.",
  "the sea was a source of food for many people.": "O mar era uma fonte de alimento para muitas pessoas.",
  "the sea was a popular destination for tourists.": "O mar era um destino popular para os turistas.",
  "the devices were used to monitor the environment.": "Os dispositivos foram usados para monitorar o ambiente.",
  "the devices were connected to the internet.": "Os dispositivos estavam conectados à Internet.",
  "the devices were used to track the location.": "Os dispositivos foram usados para rastrear a localização.",
  "the devices were a source of entertainment.": "Os dispositivos eram uma fonte de entretenimento.",
  "the devices were a tool for communication.": "Os dispositivos eram uma ferramenta de comunicação.",
  "the pending task was delayed again.": "A tarefa pendente foi adiada novamente.",
  "the pending decision was made later.": "A decisão pendente foi tomada posteriormente.",
  "the pending bills were paid on time.": "As contas pendentes foram pagas em dia.",
  "the pending lawsuit was settled out of court.": "O processo pendente foi resolvido fora do tribunal.",
  "the pending project was put on hold.": "O projeto pendente foi suspenso.",
  "she brought her friend round to meet me.": "Ela trouxe sua amiga para me conhecer.",
  "he tried to bring the patient round after the accident.": "Ele tentou trazer o paciente de volta após o acidente.",
  "can you bring the kids round to play with mine?": "Você pode trazer as crianças para brincar com as minhas?",
  "the doctor brought the patient round with a shot of adrenaline.": "O médico trouxe o paciente com uma injeção de adrenalina.",
  "they brought the old car round to the front of the house.": "Eles trouxeram o carro velho para a frente da casa.",
  "she enrolled in the university last year.": "Ela se matriculou na universidade no ano passado.",
  "he enrolled his kids in the local school.": "Ele matriculou seus filhos na escola local.",
  "can you enroll me in the course?": "Vocês podem me inscrever no curso?",
  "they enrolled in the gym to get in shape.": "Eles se matricularam na academia para entrar em forma.",
  "i enrolled in the online course to learn more.": "Eu me inscrevi no curso on-line para saber mais.",
  "kathy is a great friend.": "Kathy é uma grande amiga.",
  "kathy loves to travel.": "Kathy adora viajar.",
  "kathy is a talented artist.": "Kathy é uma artista talentosa.",
  "kathy is a great cook.": "Kathy é uma ótima cozinheira.",
  "kathy is a wonderful person.": "Kathy é uma pessoa maravilhosa.",
  "this book is heavy.": "Esse livro é pesado.",
  "the traffic was heavy today.": "O trânsito estava pesado hoje.",
  "the rain was heavy last night.": "A chuva estava forte na noite passada.",
  "the music was heavy and loud.": "A música era pesada e alta.",
  "the workload was heavy this quarter.": "A carga de trabalho foi pesada neste trimestre.",
  "the complexity of the problem is difficult to understand.": "A complexidade do problema é difícil de entender.",
  "the complexity of the system is hard to manage.": "A complexidade do sistema é difícil de gerenciar.",
  "the complexity of the project is overwhelming.": "A complexidade do projeto é impressionante.",
  "the complexity of the issue is a major concern.": "A complexidade da questão é uma grande preocupação.",
  "the complexity of the data is a challenge to analyze.": "A complexidade dos dados é um desafio para a análise.",
  "the sender of the package was unknown.": "O remetente do pacote era desconhecido.",
  "the sender of the email was a robot.": "O remetente do e-mail era um robô.",
  "the sender of the letter was a friend.": "O remetente da carta era um amigo.",
  "the sender of the package was a company.": "O remetente do pacote era uma empresa.",
  "the sender of the message was a stranger.": "O remetente da mensagem era um estranho.",
  "the fathers of the children were present.": "Os pais das crianças estavam presentes.",
  "the fathers of the bride were honored.": "Os pais da noiva foram homenageados.",
  "the fathers of the country were proud.": "Os pais do país estavam orgulhosos.",
  "the fathers of the family were supportive.": "Os pais da família me deram apoio.",
  "the fathers of the church were wise.": "Os pais da igreja eram sábios.",
  "she caught the ball in mid-air.": "Ela pegou a bola em pleno ar.",
  "he caught the flu last week.": "Ele pegou gripe na semana passada.",
  "can you catch the bus at the next stop?": "Você pode pegar o ônibus no próximo ponto?",
  "they caught the thief in the act.": "Eles pegaram o ladrão em flagrante.",
  "i caught the fish with my bare hands.": "Peguei o peixe com minhas próprias mãos.",
  "her preference was for the red car.": "Sua preferência era pelo carro vermelho.",
  "his preference was for the quiet room.": "Sua preferência era pelo quarto silencioso.",
  "their preference was for the beach vacation.": "Sua preferência era por férias na praia.",
  "my preference is for the morning.": "Minha preferência é pela manhã.",
  "the preference of the customer is our top priority.": "A preferência do cliente é nossa maior prioridade.",
  "i\u0027m grateful for your help.": "Sou grato por sua ajuda.",
  "she\u0027s grateful for the opportunity.": "Ela é grata pela oportunidade.",
  "he\u0027s grateful for the support.": "Ele é grato pelo apoio.",
  "they\u0027re grateful for the kindness.": "Eles são gratos pela gentileza.",
  "we\u0027re grateful for the love.": "Somos gratos pelo amor.",
  "she sings similarly to her sister.": "Ela canta de forma semelhante à sua irmã.",
  "he drives similarly to his father.": "Ele dirige de forma semelhante ao seu pai.",
  "the two teams play similarly.": "As duas equipes jogam de forma semelhante.",
  "the new policy is implemented similarly across all departments.": "A nova política é implementada de forma semelhante em todos os departamentos.",
  "the two artists paint similarly.": "Os dois artistas pintam de forma semelhante.",
  "the company deals with several clients.": "A empresa lida com vários clientes.",
  "she deals with difficult customers.": "Ela lida com clientes difíceis.",
  "he deals with the financial department.": "Ele lida com o departamento financeiro.",
  "the new policy deals with employee benefits.": "A nova política trata dos benefícios dos funcionários.",
  "the team deals with a tough opponent.": "A equipe lida com um adversário difícil.",
  "the company operates in a wide variety of industries.": "A empresa opera em uma ampla variedade de setores.",
  "she has experience in a variety of fields.": "Ela tem experiência em uma variedade de campos.",
  "he is interested in a wide range of topics.": "Ele se interessa por uma ampla gama de tópicos.",
  "the new policy applies to a variety of situations.": "A nova política se aplica a uma variedade de situações.",
  "the team has expertise in a variety of areas.": "A equipe tem experiência em diversas áreas.",
  "the system monitors the network traffic.": "O sistema monitora o tráfego da rede.",
  "she monitors the patient\u0027s vital signs.": "Ela monitora os sinais vitais do paciente.",
  "he monitors the stock market.": "Ele monitora o mercado de ações.",
  "the new policy monitors employee performance.": "A nova política monitora o desempenho dos funcionários.",
  "the team monitors the weather forecast.": "A equipe monitora a previsão do tempo.",
  "the company uses a proc to manage its projects.": "A empresa usa um proc para gerenciar seus projetos.",
  "she is responsible for the proc department.": "Ela é responsável pelo departamento de compras.",
  "he is an expert in the proc field.": "Ele é um especialista na área de proc.",
  "the new policy affects the proc team.": "A nova política afeta a equipe de proc.",
  "the team is working on a new proc system.": "A equipe está trabalhando em um novo sistema de proc.",
  "she is an expert in marketing.": "Ela é especialista em marketing.",
  "he is an expert in finance.": "Ele é um especialista em finanças.",
  "the team has an expert in the field.": "A equipe tem um especialista na área.",
  "the new policy requires an expert opinion.": "A nova política exige uma opinião especializada.",
  "the company hires an expert consultant.": "A empresa contrata um consultor especializado.",
  "the company is based in dayton.": "A empresa está sediada em Dayton.",
  "she is from dayton.": "Ela é de Dayton.",
  "he lives in dayton.": "Ele mora em Dayton.",
  "the new policy affects the dayton team.": "A nova política afeta a equipe de Dayton.",
  "the team is visiting dayton.": "A equipe está visitando Dayton.",
  "the body is made up of cells.": "O corpo é composto de células.",
  "she is studying cells in biology.": "Ela está estudando células em biologia.",
  "he is an expert in cell biology.": "Ele é um especialista em biologia celular.",
  "the new policy affects cell division.": "A nova política afeta a divisão celular.",
  "the team is working on a new cell therapy.": "A equipe está trabalhando em uma nova terapia celular.",
  "the company is experiencing an enlargement of its market share.": "A empresa está experimentando um aumento de sua participação no mercado.",
  "she is studying the enlargement of the universe.": "Ela está estudando a ampliação do universo.",
  "he is an expert in enlargement techniques.": "Ele é um especialista em técnicas de ampliação.",
  "the new policy affects the enlargement of the company.": "A nova política afeta a ampliação da empresa.",
  "the team is working on a new enlargement project.": "A equipe está trabalhando em um novo projeto de ampliação.",
  "the lions are the kings of the savannah.": "Os leões são os reis da savana.",
  "she is studying lions in biology.": "Ela está estudando leões em biologia.",
  "he is an expert in lion behavior.": "Ele é um especialista em comportamento de leões.",
  "the new policy affects lion conservation.": "A nova política afeta a conservação dos leões.",
  "the team is working on a new lion sanctuary.": "A equipe está trabalhando em um novo santuário de leões.",
  "she cut up the old clothes to make a quilt.": "Ela cortou as roupas velhas para fazer uma colcha.",
  "he cut up the vegetables for the salad.": "Ele cortou os legumes para a salada.",
  "the chef cut up the meat for the stir-fry.": "O chef cortou a carne para o stir-fry.",
  "the kids cut up the paper to make a collage.": "As crianças cortaram o papel para fazer uma colagem.",
  "the surgeon cut up the patient to remove the tumor.": "O cirurgião cortou o paciente para remover o tumor.",
  "she planted a tree in her backyard.": "Ela plantou uma árvore em seu quintal.",
  "he planted a garden in his front yard.": "Ele plantou um jardim em seu jardim da frente.",
  "the farmer planted wheat in the field.": "O fazendeiro plantou trigo no campo.",
  "the couple planted a vineyard on their property.": "O casal plantou um vinhedo em sua propriedade.",
  "the architect planted a flag on the roof.": "O arquiteto colocou uma bandeira no telhado.",
  "he is an attorney for the company.": "Ele é advogado da empresa.",
  "she is an attorney for the non-profit organization.": "Ela é advogada da organização sem fins lucrativos.",
  "the attorney argued the case in court.": "O advogado defendeu o caso no tribunal.",
  "the attorney negotiated the contract.": "O advogado negociou o contrato.",
  "the attorney represented the client in the trial.": "O advogado representou o cliente no julgamento.",
  "she traveled to mexico for vacation.": "Ela viajou para o México de férias.",
  "he studied in mexico for a year.": "Ele estudou no México por um ano.",
  "the couple visited mexico for their honeymoon.": "O casal visitou o México em sua lua de mel.",
  "the family went to mexico for the holidays.": "A família foi para o México nas férias.",
  "the company has a factory in mexico.": "A empresa tem uma fábrica no México.",
  "the wagon was pulled by horses.": "A carroça era puxada por cavalos.",
  "she rode in the wagon to the festival.": "Ela foi de carroça para o festival.",
  "he drove the wagon through the countryside.": "Ele dirigiu a carroça pelo campo.",
  "the wagon was filled with hay.": "A carroça estava cheia de feno.",
  "the wagon was decorated for the parade.": "O vagão foi decorado para o desfile.",
  "i\u0027ve been working here since 2010.": "Estou trabalhando aqui desde 2010.",
  "she\u0027s been living in paris since last year.": "Ela está morando em Paris desde o ano passado.",
  "he\u0027s been studying english since he was a child.": "Ele estuda inglês desde criança.",
  "the company has been in business since 1995.": "A empresa está em atividade desde 1995.",
  "the concert will start since 8pm.": "O show começará a partir das 20h.",
  "the mobile phone is very convenient.": "O telefone celular é muito conveniente.",
  "the mobile home is a great option for retirees.": "A casa móvel é uma ótima opção para aposentados.",
  "the mobile app is very user-friendly.": "O aplicativo móvel é muito fácil de usar.",
  "the mobile device is very portable.": "O dispositivo móvel é muito portátil.",
  "the mobile office is very efficient.": "O escritório móvel é muito eficiente.",
  "she writes a blog about fashion.": "Ela escreve um blog sobre moda.",
  "he maintains a blog about technology.": "Ele mantém um blog sobre tecnologia.",
  "the company has a blog about their products.": "A empresa tem um blog sobre seus produtos.",
  "the blogger shared her thoughts on the topic.": "A blogueira compartilhou suas ideias sobre o assunto.",
  "the blog was very popular among readers.": "O blog era muito popular entre os leitores.",
  "she loves watching movies on the weekend.": "Ela adora assistir a filmes no fim de semana.",
  "he went to the movies with his friends.": "Ele foi ao cinema com seus amigos.",
  "the couple watched movies on their date night.": "O casal assistiu a filmes em sua noite de encontro.",
  "the movie theater showed a new release.": "O cinema exibiu um novo lançamento.",
  "the film festival featured many independent movies.": "O festival de cinema apresentou muitos filmes independentes.",
  "i need some help.": "Preciso de ajuda.",
  "some people like coffee.": "Algumas pessoas gostam de café.",
  "some of the books are on sale.": "Alguns dos livros estão à venda.",
  "i have some money to spend.": "Tenho algum dinheiro para gastar.",
  "some students are absent today.": "Alguns alunos estão ausentes hoje.",
  "the atmosphere in the room was tense.": "A atmosfera na sala estava tensa.",
  "the atmosphere on the mountain was cold and windy.": "A atmosfera na montanha era fria e ventosa.",
  "the atmosphere in the city was vibrant and lively.": "A atmosfera da cidade era vibrante e animada.",
  "the atmosphere on the beach was relaxing and peaceful.": "A atmosfera na praia era relaxante e tranquila.",
  "the atmosphere in the restaurant was formal and elegant.": "O ambiente do restaurante era formal e elegante.",
  "the dead body was found in the river.": "O corpo morto foi encontrado no rio.",
  "the dead plant was thrown away.": "A planta morta foi jogada fora.",
  "the dead battery needed to be replaced.": "A bateria descarregada precisava ser substituída.",
  "the dead animal was buried in the forest.": "O animal morto foi enterrado na floresta.",
  "the dead language is no longer spoken.": "O idioma morto não é mais falado.",
  "i listen to podcasts every morning.": "Ouço podcasts todas as manhãs.",
  "podcasts are a great way to learn new things.": "Os podcasts são uma ótima maneira de aprender coisas novas.",
  "the podcast was very informative and interesting.": "O podcast foi muito informativo e interessante.",
  "i downloaded a new podcast on my phone.": "Baixei um novo podcast no meu celular.",
  "podcasts are a popular form of entertainment.": "Os podcasts são uma forma popular de entretenimento.",
  "the diagram helped me understand the concept.": "O diagrama me ajudou a entender o conceito.",
  "the diagram was very detailed and accurate.": "O diagrama era muito detalhado e preciso.",
  "the diagram showed the different parts of the machine.": "O diagrama mostrava as diferentes partes da máquina.",
  "the diagram was used to explain the process.": "O diagrama foi usado para explicar o processo.",
  "the diagram was a great tool for learning.": "O diagrama foi uma ótima ferramenta de aprendizado.",
  "the banking system is very secure.": "O sistema bancário é muito seguro.",
  "banking is a complex and regulated industry.": "O setor bancário é complexo e regulamentado.",
  "the banking sector is growing rapidly.": "O setor bancário está crescendo rapidamente.",
  "banking is a vital part of the economy.": "O setor bancário é uma parte vital da economia.",
  "the banking system is prone to cyber attacks.": "O sistema bancário é propenso a ataques cibernéticos.",
  "zoloft is a type of antidepressant.": "O Zoloft é um tipo de antidepressivo.",
  "zoloft is used to treat anxiety and depression.": "O Zoloft é usado para tratar ansiedade e depressão.",
  "zoloft has some side effects, such as dizziness.": "O Zoloft tem alguns efeitos colaterais, como tontura.",
  "zoloft is a popular medication for mental health.": "O Zoloft é um medicamento popular para a saúde mental.",
  "zoloft is available by prescription only.": "O Zoloft está disponível apenas com receita médica.",
  "i need to modify the code to fix the bug.": "Preciso modificar o código para corrigir o erro.",
  "the company will modify its policy to meet the new regulations.": "A empresa modificará sua política para atender às novas regulamentações.",
  "she modified her diet to lose weight.": "Ela modificou sua dieta para perder peso.",
  "he modified the car to make it faster.": "Ele modificou o carro para torná-lo mais rápido.",
  "the teacher modified the assignment to make it easier.": "O professor modificou a tarefa para torná-la mais fácil.",
  "a phd is a high-level academic degree.": "O PhD é um título acadêmico de alto nível.",
  "the phd program is very competitive.": "O programa de doutorado é muito competitivo.",
  "she earned her phd in physics.": "Ela obteve seu doutorado em física.",
  "he is working on his phd thesis.": "Ele está trabalhando em sua tese de doutorado.",
  "a phd is required for many careers in academia.": "O doutorado é necessário para muitas carreiras acadêmicas.",
  "the navigation system is not working.": "O sistema de navegação não está funcionando.",
  "can you help me with the navigation?": "Você pode me ajudar com a navegação?",
  "the navigation app is very useful.": "O aplicativo de navegação é muito útil.",
  "i need to update my navigation system.": "Preciso atualizar meu sistema de navegação.",
  "the navigation is very easy to use.": "A navegação é muito fácil de usar.",
  "please create a profile for me.": "Por favor, crie um perfil para mim.",
  "i need to update my profile picture.": "Preciso atualizar minha foto de perfil.",
  "can you help me with my profile settings?": "Você pode me ajudar com as configurações do meu perfil?",
  "the profile is very well designed.": "O perfil é muito bem projetado.",
  "i love her profile on social media.": "Adoro o perfil dela nas mídias sociais.",
  "i need to pee right now.": "Preciso fazer xixi agora mesmo.",
  "can you take me to the bathroom?": "Pode me levar ao banheiro?",
  "i\u0027m going to pee before we leave.": "Vou fazer xixi antes de sairmos.",
  "she needs to pee after drinking so much.": "Ela precisa fazer xixi depois de beber tanto.",
  "i don\u0027t want to pee in front of everyone.": "Não quero fazer xixi na frente de todo mundo.",
  "this electronic device is very useful.": "Esse dispositivo eletrônico é muito útil.",
  "the electronic store is having a sale.": "A loja de eletrônicos está em promoção.",
  "i love electronic music.": "Eu adoro música eletrônica.",
  "the electronic bill is very high.": "A conta eletrônica é muito alta.",
  "this electronic gadget is very cool.": "Esse dispositivo eletrônico é muito legal.",
  "the passenger is very happy.": "O passageiro está muito feliz.",
  "can you help the passenger with their luggage?": "Você pode ajudar o passageiro com sua bagagem?",
  "the passenger is very tired.": "O passageiro está muito cansado.",
  "i\u0027m a passenger on this flight.": "Sou um passageiro desse voo.",
  "the passenger is very nice.": "O passageiro é muito simpático.",
  "the foreign language is very difficult.": "O idioma estrangeiro é muito difícil.",
  "the foreign exchange rate is very high.": "A taxa de câmbio é muito alta.",
  "i love foreign food.": "Eu adoro comida estrangeira.",
  "the foreign policy is very complex.": "A política externa é muito complexa.",
  "the foreign student is very friendly.": "O estudante estrangeiro é muito amigável.",
  "silicon is a very useful material.": "O silício é um material muito útil.",
  "the silicon chip is very small.": "O chip de silício é muito pequeno.",
  "i need to buy some silicon for my project.": "Preciso comprar silicone para meu projeto.",
  "the silicon valley is very famous.": "O Vale do Silício é muito famoso.",
  "the silicon dioxide is very common.": "O dióxido de silício é muito comum.",
  "does she like coffee?": "Ela gosta de café?",
  "i do not know what to do.": "Não sei o que fazer.",
  "does he like reading?": "Ele gosta de ler?",
  "does she like music?": "Ela gosta de música?",
  "does he like sports?": "Ele gosta de esportes?",
  "the unauthorized access is very dangerous.": "O acesso não autorizado é muito perigoso.",
  "the unauthorized use of the software is illegal.": "O uso não autorizado do software é ilegal.",
  "i need to get an authorization for this.": "Preciso obter uma autorização para isso.",
  "the unauthorized person is very suspicious.": "A pessoa não autorizada é muito suspeita.",
  "the unauthorized access to the system is very common.": "O acesso não autorizado ao sistema é muito comum.",
  "the suburban area is very quiet.": "A área suburbana é muito tranquila.",
  "the suburban house is very big.": "A casa suburbana é muito grande.",
  "i love the suburban life.": "Adoro a vida no subúrbio.",
  "the suburban school is very good.": "A escola suburbana é muito boa.",
  "the suburban area is very safe.": "A área suburbana é muito segura.",
  "i\u0027m going to the store with my friends.": "Estou indo à loja com meus amigos.",
  "the book is on the table with the pen.": "O livro está sobre a mesa com a caneta.",
  "the baby is playing with the ball.": "O bebê está brincando com a bola.",
  "the teacher is with the students.": "O professor está com os alunos.",
  "the car is parked with the other cars.": "O carro está estacionado com os outros carros.",
  "the babes are playing in the park.": "Os bebês estão brincando no parque.",
  "the new mom is holding her babes.": "A nova mamãe está segurando seus bebês.",
  "the babysitter is taking care of the babes.": "A babá está cuidando dos bebês.",
  "the couple has two babes.": "O casal tem dois bebês.",
  "the doctor is checking on the babes.": "O médico está examinando os bebês.",
  "can you please put the food in the microwave?": "Você pode colocar a comida no micro-ondas?",
  "the microwave is beeping.": "O micro-ondas está apitando.",
  "i\u0027m going to heat up some water in the microwave.": "Vou esquentar um pouco de água no micro-ondas.",
  "the microwave is not working.": "O micro-ondas não está funcionando.",
  "the microwave is in the kitchen.": "O micro-ondas fica na cozinha.",
  "the sewing machine is broken.": "A máquina de costura está quebrada.",
  "i\u0027m going to the sewing class tonight.": "Estou indo para a aula de costura hoje à noite.",
  "the seamstress is expert in sewing.": "A costureira é especialista em costura.",
  "the sewing kit is in the drawer.": "O kit de costura está na gaveta.",
  "the sewing project is almost finished.": "O projeto de costura está quase concluído.",
  "the trip to america was amazing.": "A viagem aos Estados Unidos foi incrível.",
  "the family is moving to america.": "A família está se mudando para os Estados Unidos.",
  "the america\u0027s cup is a famous sailing competition.": "A America\u0027s Cup é uma famosa competição de vela.",
  "the america\u0027s history is rich and diverse.": "A história dos Estados Unidos é rica e diversificada.",
  "the america\u0027s culture is a mix of different influences.": "A cultura americana é uma mistura de diferentes influências.",
  "the car is parked in the garage.": "O carro está estacionado na garagem.",
  "the garage is full of tools.": "A garagem está cheia de ferramentas.",
  "the garage door is open.": "A porta da garagem está aberta.",
  "the garage is being renovated.": "A garagem está sendo reformada.",
  "the garage sale is tomorrow.": "A venda de garagem será amanhã.",
  "the dog is dragging its chain.": "O cão está arrastando sua corrente.",
  "the child is dragging his feet.": "A criança está arrastando os pés.",
  "the plane is dragging its wings.": "O avião está arrastando as asas.",
  "the team is dragging behind.": "A equipe está se arrastando para trás.",
  "the rope is dragging on the ground.": "A corda está se arrastando no chão.",
  "the confusion in the air is palpable.": "A confusão no ar é palpável.",
  "the confusion is causing a delay.": "A confusão está causando um atraso.",
  "the teacher is trying to clear up the confusion.": "O professor está tentando esclarecer a confusão.",
  "the confusion is making it hard to understand.": "A confusão está dificultando a compreensão.",
  "the confusion is a common problem in this industry.": "A confusão é um problema comum nesse setor.",
  "the balance of the account is zero.": "O saldo da conta é zero.",
  "the balance of the seesaw is perfect.": "O equilíbrio do balanço é perfeito.",
  "the balance of the ecosystem is delicate.": "O equilíbrio do ecossistema é delicado.",
  "the balance of the checkbook is off.": "O saldo do talão de cheques está fora.",
  "the balance of the diet is crucial.": "O equilíbrio da dieta é fundamental.",
  "jesus is the son of god.": "Jesus é o filho de Deus.",
  "jesus was a prophet.": "Jesus foi um profeta.",
  "jesus is a symbol of love.": "Jesus é um símbolo de amor.",
  "jesus is a central figure in christianity.": "Jesus é uma figura central no cristianismo.",
  "jesus is a name that is revered worldwide.": "Jesus é um nome reverenciado em todo o mundo.",
  "the company\u0027s revenues increased last year.": "As receitas da empresa aumentaram no ano passado.",
  "the government relies on tax revenues to fund public services.": "O governo depende das receitas fiscais para financiar os serviços públicos.",
  "the company\u0027s revenues are expected to grow in the next quarter.": "Espera-se que as receitas da empresa cresçam no próximo trimestre.",
  "the charity\u0027s revenues are used to support local communities.": "As receitas da instituição de caridade são usadas para apoiar as comunidades locais.",
  "the company\u0027s revenues are affected by the global economic downturn.": "As receitas da empresa são afetadas pela desaceleração econômica global.",
  "the animal was trapped in the cage.": "O animal estava preso na gaiola.",
  "the police trapped the suspect in the building.": "A polícia prendeu o suspeito no prédio.",
  "the company tried to trap the customer into a contract.": "A empresa tentou prender o cliente em um contrato.",
  "the animal trapped its prey in the bush.": "O animal prendeu sua presa no mato.",
  "the hikers got trapped in the snowstorm.": "Os caminhantes ficaram presos em uma tempestade de neve.",
  "the child was taken into custody by the social services.": "A criança foi levada sob custódia pelos serviços sociais.",
  "the suspect is being held in custody until the trial.": "O suspeito está sendo mantido sob custódia até o julgamento.",
  "the company is in custody of the intellectual property.": "A empresa detém a custódia da propriedade intelectual.",
  "the animal was taken into custody by the wildlife rescue team.": "O animal foi levado sob custódia pela equipe de resgate de animais selvagens.",
  "the police took the suspect into custody for questioning.": "A polícia levou o suspeito sob custódia para interrogatório.",
  "the colonial architecture of the building is impressive.": "A arquitetura colonial do edifício é impressionante.",
  "the country was a colonial power in the 19th century.": "O país foi uma potência colonial no século XIX.",
  "the colonial legacy still affects the country\u0027s politics.": "O legado colonial ainda afeta a política do país.",
  "the museum features colonial artifacts from around the world.": "O museu apresenta artefatos coloniais de todo o mundo.",
  "the colonial era was marked by exploitation and oppression.": "A era colonial foi marcada pela exploração e opressão.",
  "the city\u0027s trash management system is inefficient.": "O sistema de gerenciamento de lixo da cidade é ineficiente.",
  "the company is responsible for disposing of the trash.": "A empresa é responsável pelo descarte do lixo.",
  "the park is filled with trash and debris.": "O parque está cheio de lixo e detritos.",
  "the recycling program helps reduce the amount of trash.": "O programa de reciclagem ajuda a reduzir a quantidade de lixo.",
  "the smell of trash is overwhelming in the alley.": "O cheiro de lixo é intenso no beco.",
  "the spy used an alias to conceal her identity.": "A espiã usou um pseudônimo para ocultar sua identidade.",
  "the company uses an alias for its online presence.": "A empresa usa um pseudônimo para sua presença on-line.",
  "the author wrote under an alias to protect her identity.": "A autora escreveu sob um pseudônimo para proteger sua identidade.",
  "the alias was used to track the suspect\u0027s movements.": "O pseudônimo foi usado para rastrear os movimentos do suspeito.",
  "the alias was revealed in the investigation.": "O pseudônimo foi revelado na investigação.",
  "the painting is a valuable work of art.": "A pintura é uma obra de arte valiosa.",
  "the company\u0027s shares are considered valuable.": "As ações da empresa são consideradas valiosas.",
  "the experience was valuable for my personal growth.": "A experiência foi valiosa para meu crescimento pessoal.",
  "the antique is a valuable collector\u0027s item.": "A antiguidade é um valioso item de colecionador.",
  "the knowledge is valuable for the scientific community.": "O conhecimento é valioso para a comunidade científica.",
  "the company has strong connections with the local community.": "A empresa tem fortes conexões com a comunidade local.",
  "the researcher made connections between the data points.": "O pesquisador fez conexões entre os pontos de dados.",
  "the social media platform helps users make connections.": "A plataforma de mídia social ajuda os usuários a fazer conexões.",
  "the artist\u0027s connections to the art world are extensive.": "As conexões do artista com o mundo da arte são extensas.",
  "the company\u0027s connections to the industry are valuable.": "As conexões da empresa com o setor são valiosas.",
  "the book has a large readership among young adults.": "O livro tem um grande número de leitores entre os jovens adultos.",
  "the company targets readers of the online magazine.": "A empresa tem como alvo os leitores da revista on-line.",
  "the author\u0027s readers are passionate about her work.": "Os leitores da autora são apaixonados por seu trabalho.",
  "the newspaper has a dedicated readership in the city.": "O jornal tem um público leitor dedicado na cidade.",
  "the company\u0027s readers are mostly professionals.": "Os leitores da empresa são, em sua maioria, profissionais.",
  "the button was pressed to activate the alarm.": "O botão foi pressionado para ativar o alarme.",
  "the company was pressed to release the statement.": "A empresa foi pressionada a divulgar a declaração.",
  "the flowers were pressed to preserve them.": "As flores foram prensadas para preservá-las.",
  "the suspect was pressed to confess.": "O suspeito foi pressionado a confessar.",
  "the button was pressed to send the message.": "O botão foi pressionado para enviar a mensagem.",
  "i\u0027ll be back in an hour.": "Voltarei em uma hora.",
  "she\u0027s been back from her vacation for a week.": "Ela voltou de suas férias há uma semana.",
  "he\u0027s been back to his hometown for the holidays.": "Ele voltou para sua cidade natal para as festas de fim de ano.",
  "they\u0027ll be back next month.": "Eles voltarão no próximo mês.",
  "we\u0027ve been back to the same restaurant for years.": "Voltamos ao mesmo restaurante há anos.",
  "the transition from high school to college was smooth.": "A transição do ensino médio para a faculdade foi tranquila.",
  "the new policy is a transition from the old one.": "A nova política é uma transição da antiga.",
  "the company is going through a transition period.": "A empresa está passando por um período de transição.",
  "the team is in transition after the coach left.": "A equipe está em transição após a saída do técnico.",
  "the artist\u0027s style is a transition from realism to abstraction.": "O estilo do artista é uma transição do realismo para a abstração.",
  "the advisory board consists of experts in the field.": "O conselho consultivo é formado por especialistas da área.",
  "the company provides advisory services to startups.": "A empresa presta serviços de consultoria a startups.",
  "the government issued an advisory warning about the storm.": "O governo emitiu um aviso de alerta sobre a tempestade.",
  "the professor offered advisory guidance to the students.": "O professor ofereceu orientação consultiva aos alunos.",
  "the hotel has an advisory on the use of towels.": "O hotel tem um aviso sobre o uso de toalhas.",
  "the government increased the tax on luxury items.": "O governo aumentou o imposto sobre itens de luxo.",
  "the company is exempt from paying tax on exports.": "A empresa está isenta do pagamento de impostos sobre as exportações.",
  "the tax on sugary drinks is a health concern.": "O imposto sobre bebidas açucaradas é um problema de saúde.",
  "the tax refund was processed quickly.": "A restituição de impostos foi processada rapidamente.",
  "the tax on real estate is high in this area.": "O imposto sobre imóveis é alto nessa área.",
  "the arguments presented in the debate were convincing.": "Os argumentos apresentados no debate foram convincentes.",
  "the lawyer presented strong arguments to the judge.": "O advogado apresentou argumentos sólidos ao juiz.",
  "the arguments for and against the proposal were discussed.": "Os argumentos a favor e contra a proposta foram discutidos.",
  "the professor provided arguments to support the theory.": "O professor forneceu argumentos para apoiar a teoria.",
  "the arguments in the essay were well-structured.": "Os argumentos da redação foram bem estruturados.",
  "the navigation system on the phone is accurate.": "O sistema de navegação do telefone é preciso.",
  "the company provides navigation services to tourists.": "A empresa fornece serviços de navegação para turistas.",
  "the pilot used navigation tools to find the airport.": "O piloto usou ferramentas de navegação para encontrar o aeroporto.",
  "the website has a navigation menu for easy access.": "O site tem um menu de navegação para facilitar o acesso.",
  "the gps device is a navigation aid.": "O dispositivo GPS é um auxílio à navegação.",
  "the arctic region is cold and icy.": "A região ártica é fria e gelada.",
  "the arctic fox is a unique species.": "A raposa do ártico é uma espécie única.",
  "the arctic expedition was a success.": "A expedição ao Ártico foi um sucesso.",
  "the arctic air is crisp and refreshing.": "O ar ártico é fresco e refrescante.",
  "the arctic landscape is breathtaking.": "A paisagem ártica é de tirar o fôlego.",
  "the rug in the living room is soft and plush.": "O tapete da sala de estar é macio e felpudo.",
  "the rug in the hallway is worn out.": "O tapete do corredor está desgastado.",
  "the rug in the bedroom is a beautiful design.": "O tapete do quarto tem um belo design.",
  "the rug in the office is a good insulator.": "O tapete do escritório é um bom isolante.",
  "the rug in the kitchen is easy to clean.": "O tapete da cozinha é fácil de limpar.",
  "the stream in the forest is crystal clear.": "O riacho na floresta é cristalino.",
  "the stream in the backyard is a good spot for fishing.": "O riacho no quintal é um bom lugar para pescar.",
  "the stream of water is refreshing.": "O fluxo de água é refrescante.",
  "the stream of data is overwhelming.": "O fluxo de dados é avassalador.",
  "the stream of consciousness is a literary device.": "O fluxo de consciência é um dispositivo literário.",
  "the state of dakota is located in the midwest.": "O estado de Dakota está localizado no meio-oeste.",
  "the dakota tribe is indigenous to the region.": "A tribo Dakota é nativa da região.",
  "the dakota territory was a historical region.": "O Território de Dakota era uma região histórica.",
  "the dakota language is a native american dialect.": "O idioma Dakota é um dialeto nativo americano.",
  "the dakota people have a rich cultural heritage.": "O povo Dakota tem um rico patrimônio cultural.",
  "the comedy show was very funny.": "O show de comédia foi muito engraçado.",
  "she\u0027s a comedian and a writer.": "Ela é comediante e escritora.",
  "the comedy club is a great place to go.": "O clube de comédia é um ótimo lugar para ir.",
  "the comedy festival is coming soon.": "O festival de comédia está chegando.",
  "the comedy show was a huge success.": "O show de comédia foi um grande sucesso.",
  "he\u0027s planning to retire soon.": "Ele está planejando se aposentar em breve.",
  "she\u0027s been retired for 10 years.": "Ela está aposentada há 10 anos.",
  "the retirement package is very generous.": "O pacote de aposentadoria é muito generoso.",
  "he\u0027s looking forward to his retirement.": "Ele está ansioso por sua aposentadoria.",
  "the retirement age is increasing.": "A idade de aposentadoria está aumentando.",
  "the new car is compared with/to the old one.": "O novo carro é comparado com/ao antigo.",
  "she\u0027s compared with/to her sister.": "Ela é comparada com/à sua irmã.",
  "the new policy is compared with/to the old one.": "A nova política é comparada com a antiga.",
  "the two teams are compared with/to each other.": "As duas equipes são comparadas uma com a outra.",
  "the new phone is compared with/to the old one.": "O novo telefone é comparado com/ao antigo.",
  "the meaning of life is a mystery.": "O significado da vida é um mistério.",
  "she\u0027s trying to understand the meaning of the poem.": "Ela está tentando entender o significado do poema.",
  "the meaning of the word is unclear.": "O significado da palavra não é claro.",
  "the meaning of the sentence is ambiguous.": "O significado da frase é ambíguo.",
  "the meaning of the dream is unknown.": "O significado do sonho é desconhecido.",
  "the doctor prescribed a drug for her illness.": "O médico receitou um medicamento para sua doença.",
  "the drug is highly addictive.": "A droga é altamente viciante.",
  "the new drug is being tested.": "O novo medicamento está sendo testado.",
  "the drug is available over the counter.": "O medicamento está disponível sem prescrição médica.",
  "the drug is a controlled substance.": "O medicamento é uma substância controlada.",
  "the sexual harassment policy is clear.": "A política de assédio sexual é clara.",
  "the sexual orientation of the person is unknown.": "A orientação sexual da pessoa é desconhecida.",
  "the sexual health clinic is open.": "A clínica de saúde sexual está aberta.",
  "the sexual assault is a serious crime.": "A agressão sexual é um crime grave.",
  "the sexual relationship is complicated.": "O relacionamento sexual é complicado.",
  "the company has a strict policy.": "A empresa tem uma política rigorosa.",
  "the government has a new policy.": "O governo tem uma nova política.",
  "the policy is unclear.": "A política não é clara.",
  "the policy is being reviewed.": "A política está sendo revisada.",
  "the policy is a good idea.": "A apólice é uma boa ideia.",
  "the attitudes towards the new policy are mixed.": "As atitudes em relação à nova política são variadas.",
  "the attitudes of the people are changing.": "As atitudes das pessoas estão mudando.",
  "the attitudes towards the environment are important.": "As atitudes em relação ao meio ambiente são importantes.",
  "the attitudes of the company are unclear.": "As atitudes da empresa não são claras.",
  "the attitudes towards the new product are positive.": "As atitudes em relação ao novo produto são positivas.",
  "i\u0027ll see you soon.": "Vejo você em breve.",
  "the party is starting soon.": "A festa começará em breve.",
  "the train is arriving soon.": "O trem chegará em breve.",
  "the weather is changing soon.": "O tempo vai mudar em breve.",
  "the baby is coming soon.": "O bebê chegará em breve.",
  "the retention rate of the company is high.": "A taxa de retenção da empresa é alta.",
  "the retention of the water is a problem.": "A retenção de água é um problema.",
  "the retention of the employees is a challenge.": "A retenção dos funcionários é um desafio.",
  "the retention of the customers is important.": "A retenção de clientes é importante.",
  "the retention of the data is secure.": "A retenção dos dados é segura.",
  "the kingdom was ruled by a wise king.": "O reino era governado por um rei sábio.",
  "the kingdom is a sovereign state.": "O reino é um estado soberano.",
  "the kingdom is a feudal system.": "O reino é um sistema feudal.",
  "the kingdom is a constitutional monarchy.": "O reino é uma monarquia constitucional.",
  "the kingdom is a parliamentary system.": "O reino é um sistema parlamentar.",
  "the relations between the two countries are good.": "As relações entre os dois países são boas.",
  "the relations between the two friends are close.": "As relações entre os dois amigos são próximas.",
  "the relations between the two companies are complex.": "As relações entre as duas empresas são complexas.",
  "the relations between the two families are strained.": "As relações entre as duas famílias são tensas.",
  "the relations between the two cultures are rich.": "As relações entre as duas culturas são ricas.",
  "the optimization of the process improved efficiency.": "A otimização do processo melhorou a eficiência.",
  "the optimization of the system is ongoing.": "A otimização do sistema está em andamento.",
  "the optimization of the algorithm is challenging.": "A otimização do algoritmo é um desafio.",
  "the optimization of the product is key.": "A otimização do produto é fundamental.",
  "the optimization of the service is essential.": "A otimização do serviço é essencial.",
  "the fuzzy picture was hard to see.": "A imagem difusa era difícil de ver.",
  "the fuzzy memory is still unclear.": "A memória difusa ainda não está clara.",
  "the fuzzy concept is difficult to grasp.": "O conceito difuso é difícil de entender.",
  "the fuzzy line between reality and fantasy is blurred.": "A linha tênue entre a realidade e a fantasia é tênue.",
  "the fuzzy feeling in my stomach is unsettling.": "A sensação de confusão em meu estômago é inquietante.",
  "the lover was waiting for her outside.": "O amante estava esperando por ela do lado de fora.",
  "the lover was a kind and gentle soul.": "O amante era uma alma gentil e amável.",
  "the lover was a passionate and romantic person.": "O amante era uma pessoa apaixonada e romântica.",
  "the lover was a loyal and dedicated partner.": "O amante era um parceiro leal e dedicado.",
  "the lover was a free-spirited and adventurous person.": "O amante era uma pessoa de espírito livre e aventureiro.",
  "the divisions between the two teams were clear.": "As divisões entre as duas equipes eram claras.",
  "the divisions within the company were deep.": "As divisões dentro da empresa eram profundas.",
  "the divisions between the two cultures were significant.": "As divisões entre as duas culturas eram significativas.",
  "the divisions between the two families were long-standing.": "As divisões entre as duas famílias eram de longa data.",
  "the divisions between the two ideologies were stark.": "As divisões entre as duas ideologias eram gritantes.",
  "the rouge on her cheeks was subtle.": "O ruge em suas bochechas era sutil.",
  "the rouge on the walls was faded.": "O rouge nas paredes estava desbotado.",
  "the rouge on the lips was bold.": "O rouge nos lábios era ousado.",
  "the rouge on the flowers was vibrant.": "O rouge nas flores era vibrante.",
  "the rouge on the sunset was breathtaking.": "O vermelho do pôr do sol era de tirar o fôlego.",
  "the amendment to the constitution was approved.": "A emenda à constituição foi aprovada.",
  "the amendment to the law was necessary.": "A alteração da lei era necessária.",
  "the amendment to the policy was significant.": "A alteração da política foi significativa.",
  "the amendment to the contract was minor.": "A alteração do contrato foi pequena.",
  "the amendment to the system was complex.": "A alteração do sistema foi complexa.",
  "it turned out that the movie was great.": "No fim das contas, o filme foi ótimo.",
  "the concert turned out to be a huge success.": "O show acabou sendo um grande sucesso.",
  "the experiment turned out to be a failure.": "O experimento acabou sendo um fracasso.",
  "the surprise party turned out to be a success.": "A festa surpresa acabou sendo um sucesso.",
  "the new policy turned out to be unpopular.": "A nova política acabou se tornando impopular.",
  "i see the movie tonight.": "Vou ver o filme hoje à noite.",
  "can you see the tv from here?": "Você consegue ver a TV daqui?",
  "she sees the world in a different way.": "Ela vê o mundo de uma maneira diferente.",
  "he sees the problem clearly.": "Ele vê o problema com clareza.",
  "they see the beauty in nature.": "Eles veem a beleza da natureza.",
  "he is a fat cat.": "Ele é um gato gordo.",
  "the fat man walked into the room.": "O homem gordo entrou na sala.",
  "the fat cat is sleeping.": "O gato gordo está dormindo.",
  "the fat dog is happy.": "O cachorro gordo está feliz.",
  "the fat woman is eating a sandwich.": "A mulher gorda está comendo um sanduíche.",
  "she sings well.": "Ela canta bem.",
  "he plays the guitar well.": "Ele toca bem o violão.",
  "the food tastes well.": "A comida é bem saborosa.",
  "the team plays well.": "A equipe joga bem.",
  "the student writes well.": "O aluno escreve bem.",
  "the marathon is tomorrow.": "A maratona é amanhã.",
  "she ran a marathon last week.": "Ela correu uma maratona na semana passada.",
  "the marathon is a long race.": "A maratona é uma corrida longa.",
  "the marathon is a test of endurance.": "A maratona é um teste de resistência.",
  "the marathon is a popular event.": "A maratona é um evento popular.",
  "the mapping of the genome is a complex task.": "O mapeamento do genoma é uma tarefa complexa.",
  "the mapping of the city is a big project.": "O mapeamento da cidade é um grande projeto.",
  "the mapping of the stars is a challenging task.": "O mapeamento das estrelas é uma tarefa desafiadora.",
  "the mapping of the brain is a fascinating field.": "O mapeamento do cérebro é um campo fascinante.",
  "the mapping of the ocean is a difficult task.": "O mapeamento do oceano é uma tarefa difícil.",
  "the eternal love story is a classic tale.": "A história de amor eterno é um conto clássico.",
  "the eternal flame burns brightly.": "A chama eterna arde intensamente.",
  "the eternal life is a myth.": "A vida eterna é um mito.",
  "the eternal sunshine is a rare phenomenon.": "O sol eterno é um fenômeno raro.",
  "the eternal darkness is a scary experience.": "A escuridão eterna é uma experiência assustadora.",
  "i spent the weekend at the beach.": "Passei o fim de semana na praia.",
  "she spent her money on clothes.": "Ela gastava seu dinheiro em roupas.",
  "he spent the night at the hotel.": "Ele passou a noite no hotel.",
  "they spent the day at the park.": "Eles passaram o dia no parque.",
  "we spent the evening watching movies.": "Passamos a noite assistindo a filmes.",
  "the movie is sexually explicit.": "O filme é sexualmente explícito.",
  "the book is sexually suggestive.": "O livro é sexualmente sugestivo.",
  "the artist is sexually provocative.": "O artista é sexualmente provocativo.",
  "the music is sexually charged.": "A música é sexualmente carregada.",
  "the dance is sexually suggestive.": "A dança é sexualmente sugestiva.",
  "the soccer game is tonight.": "O jogo de futebol é hoje à noite.",
  "she plays soccer with her friends.": "Ela joga futebol com seus amigos.",
  "he loves playing soccer.": "Ele adora jogar futebol.",
  "the soccer team won the championship.": "O time de futebol ganhou o campeonato.",
  "the soccer stadium is full.": "O estádio de futebol está lotado.",
  "the percent of students who passed the test is high.": "A porcentagem de alunos que passaram no teste é alta.",
  "the percent of people who own a car is increasing.": "A porcentagem de pessoas que possuem um carro está aumentando.",
  "the percent of the population who speaks english is low.": "A porcentagem da população que fala inglês é baixa.",
  "the percent of the company\u0027s profits that goes to charity is high.": "A porcentagem dos lucros da empresa que vai para a caridade é alta.",
  "the percent of the students who are satisfied with the course is high.": "A porcentagem de alunos que estão satisfeitos com o curso é alta."
}